# Pandas Basic

In [1]:
from IPython.display import Image

from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 1. Introduction to pandas data structuresÂ¶

### Series

In [3]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj2 = Series([4,7,-5,3], index=['d', 'b', 'a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [13]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [16]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
states = ['California', "Ohio", 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [22]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [31]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002],
        'pop'  : [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [32]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [34]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [35]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                  index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [36]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [37]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [38]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
frame2.ix['three']

C:\Python\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [45]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [48]:
frame2.debt = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [50]:
frame2['eastern'] = frame2.state == "Ohio"
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   0.0     True
two    2001    Ohio  1.7   1.0     True
three  2002    Ohio  3.6   2.0     True
four   2001  Nevada  2.4   3.0    False
five   2002  Nevada  2.9   4.0    False

In [51]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [53]:
pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
      'Ohio' : {2000: 1.5, 2001: 17.7, 2002 : 3.6}}
frame3 = DataFrame(pop)

In [54]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4  17.7
2002     2.9   3.6

In [55]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5  17.7   3.6

In [56]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4  17.7
2002     2.9   3.6
2003     NaN   NaN

In [57]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4  17.7
2002     2.9   3.6

In [58]:
pdata = {'Ohio' : frame3['Ohio'][:-1],
        'Nevada' : frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001  17.7     2.4

In [61]:
frame3['Ohio'][:-1]

2000     1.5
2001    17.7
Name: Ohio, dtype: float64

### Index objects

In [63]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [64]:
index[1:]

Index(['b', 'c'], dtype='object')

In [69]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5,0], index=index)
obj2.index is index

True

In [71]:
a=DataFrame(obj2)
a

     0
0  1.5
1 -2.5
2  0.0

In [66]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4  17.7
2002     2.9   3.6

In [67]:
'Ohio' in frame3.columns

True

In [68]:
2003 in frame3.index

False

# Pandas Basic2

### Reindexing

In [72]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [73]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [74]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [75]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [76]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [77]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [78]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [82]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [83]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

In [84]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [85]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [86]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [87]:
data = DataFrame(np.arange(16).reshape((4,4,)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [92]:
data.drop(['Ohio', axis=1)

SyntaxError: invalid syntax (<ipython-input-92-e2b26f8d44ad>, line 1)

### Indexing, selection, and filtering

In [93]:
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [94]:
obj['b']

1.0

In [95]:
obj[1]

1.0

In [96]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [97]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [106]:
obj[[1,3]]

b    5.0
d    3.0
dtype: float64

In [100]:
obj[obj <2]

a    0.0
b    1.0
dtype: float64

In [108]:
obj['b':'d']

b    5.0
c    5.0
d    3.0
dtype: float64

In [103]:
obj['b':'c']=5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [111]:
data = DataFrame(np.arange(16).reshape((4,4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [114]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [115]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [116]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [117]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [118]:
data[data<5] = 0

In [119]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Arithmetic and data alignment

In [120]:
s1 = Series([ 7.3, -2.5, 3.4, 1.5],    index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [121]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [122]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [124]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [125]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [127]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [128]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [129]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [130]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [131]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [132]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [133]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [134]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [135]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

#### DataFrameê³¼ Series ê°ì ì°ì°

In [138]:
arr = np.arange(12.0).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [139]:
arr[0]

array([0., 1., 2., 3.])

In [140]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [141]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [143]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [144]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [145]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [146]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [147]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [149]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                 index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [150]:
frame

               b         d         e
Utah    0.214582 -0.391777  0.463796
Ohio   -0.588510 -1.166968 -0.449761
Texas   1.054363  0.171346 -0.133327
Oregon  0.138027  0.128539 -0.075098

In [151]:
np.abs(frame)

               b         d         e
Utah    0.214582  0.391777  0.463796
Ohio    0.588510  1.166968  0.449761
Texas   1.054363  0.171346  0.133327
Oregon  0.138027  0.128539  0.075098

In [152]:
f = lambda x: x.max()-x.min()

In [153]:
frame.apply(f)

b    1.642873
d    1.338314
e    0.913557
dtype: float64

In [154]:
frame.apply(f, axis=1)

Utah      0.855573
Ohio      0.717207
Texas     1.187690
Oregon    0.213125
dtype: float64

In [157]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.588510 -1.166968 -0.449761
max  1.054363  0.171346  0.463796

In [158]:
frame

               b         d         e
Utah    0.214582 -0.391777  0.463796
Ohio   -0.588510 -1.166968 -0.449761
Texas   1.054363  0.171346 -0.133327
Oregon  0.138027  0.128539 -0.075098

In [160]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.21  -0.39   0.46
Ohio    -0.59  -1.17  -0.45
Texas    1.05   0.17  -0.13
Oregon   0.14   0.13  -0.08

In [161]:
frame['e'].map(format)

Utah       0.46
Ohio      -0.45
Texas     -0.13
Oregon    -0.08
Name: e, dtype: object

### Sorting and ranking

In [165]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [167]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [168]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [169]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [170]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [172]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [173]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [174]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [175]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [176]:
obj.rank(ascending=False, method='dense')

0    1.0
1    5.0
2    1.0
3    2.0
4    3.0
5    4.0
6    2.0
dtype: float64

# Pandas Basic 3

In [7]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [9]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
              index = ['a', 'b', 'c', 'd'],
              columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [10]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [11]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [12]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [14]:
df.mean(axis=1, skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [15]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [17]:
df.idxmax()

one    b
two    d
dtype: object

In [18]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [21]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [23]:
obj = Series(['a', 'a', 'b', 'c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Unique values, value counts, and membership

In [24]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [25]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [26]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [29]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
b    2
a    3
dtype: int64

In [30]:
pd.value_counts(obj.values, sort=True)

a    3
c    3
b    2
d    1
dtype: int64

In [31]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [32]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [34]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [35]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

# Pandas Basic 4

## 4. Handling missing dataÂ¶

In [36]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [37]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [39]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [40]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [41]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [42]:
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [45]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [46]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [47]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [49]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [53]:
df = DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.999395  0.894706  0.305826
1 -1.185390 -0.103305  1.126526
2  0.875660 -0.204266 -0.520942
3 -0.837002 -2.076164 -1.046853
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

In [54]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  0.999395       NaN       NaN
1 -1.185390       NaN       NaN
2  0.875660       NaN -0.520942
3 -0.837002       NaN -1.046853
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

In [55]:
df.dropna(thresh=3)

          0         1         2
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

In [59]:
df.dropna(thresh = 2)

          0         1         2
2  0.875660       NaN -0.520942
3 -0.837002       NaN -1.046853
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

In [60]:
df.dropna(thresh = 1)

          0         1         2
0  0.999395       NaN       NaN
1 -1.185390       NaN       NaN
2  0.875660       NaN -0.520942
3 -0.837002       NaN -1.046853
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

### Filling in missing data Â¶

In [61]:
df

          0         1         2
0  0.999395       NaN       NaN
1 -1.185390       NaN       NaN
2  0.875660       NaN -0.520942
3 -0.837002       NaN -1.046853
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

In [62]:
df.fillna(0)

          0         1         2
0  0.999395  0.000000  0.000000
1 -1.185390  0.000000  0.000000
2  0.875660  0.000000 -0.520942
3 -0.837002  0.000000 -1.046853
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

In [64]:
df.fillna({1:0.5,2:-1})

          0         1         2
0  0.999395  0.500000 -1.000000
1 -1.185390  0.500000 -1.000000
2  0.875660  0.500000 -0.520942
3 -0.837002  0.500000 -1.046853
4 -1.176205  0.411592  0.035022
5 -0.892791 -1.675023  0.241675
6 -0.502812 -0.664119  0.621275

In [ ]:
_ = df.fillna(0, inplace=True)
df

## merge

### concat

In [2]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.776108  1.096358  1.712984 -0.795329
1  0.265002  0.045340 -0.061496 -0.943000
2 -0.776802 -0.465030 -0.566565 -0.129967
3 -0.157172  0.263332 -0.869071 -0.247596
4 -0.733746 -0.166332 -0.020421 -0.426837
5  1.027996 -1.164065  0.579914  0.316703
6  0.080467  1.275549 -0.860805 -0.590697
7 -0.466232  0.232403 -0.087870 -0.732210
8  0.718613  0.158886 -0.650408 -1.530451
9 -1.296991  0.390488  0.342478  0.901821

In [6]:
pieces = [df[2:2], df[1:3]]

In [7]:
pd.concat(pieces)

          0        1         2         3
1  0.265002  0.04534 -0.061496 -0.943000
2 -0.776802 -0.46503 -0.566565 -0.129967

### join

In [11]:
left = pd.DataFrame({'key' : ['foo', 'foo'], 'lval': [1,2]})
right = pd.DataFrame({'key' : ['foo', 'foo'], 'rval':[4,5]})

In [12]:
left

   key  lval
0  foo     1
1  foo     2

In [13]:
right

   key  rval
0  foo     4
1  foo     5

In [14]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### Grouping

In [15]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.000693  0.054531
1  bar    one -0.295370 -0.124546
2  foo    two -1.502959  0.780460
3  bar  three  0.963584  0.499347
4  foo    two  0.074521  2.349851
5  bar    two  0.116647 -0.603769
6  foo    one  0.763075 -0.291096
7  foo  three  0.081596  1.002847

In [17]:
df.groupby('A').sum()

            C         D
A
bar  0.784861 -0.228968
foo -0.583074  3.896592

In [19]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.295370 -0.124546
    three  0.963584  0.499347
    two    0.116647 -0.603769
foo one    0.763769 -0.236565
    three  0.081596  1.002847
    two   -1.428439  3.130311